Autodesk.Revit.DB.FabricationServiceButton.IsSizeValidForCondition(System.Int32,System.Double,System.Double)
Checks if the condition is valid for specified size.
condition:
The condition index.
widthOrDiameter:
The width or diameter of the size to check.
depth:
The depth of the size to check.
Returns:
True if the condition is valid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index condition is not larger or equal to 0 and less than ConditionCount.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.ContainsFabricationPartType(Autodesk.Revit.DB.FabricationPartType)
Checks to see if the fabrication part type exists on one of the button conditions.
partType:
The fabrication part type to check.
Returns:
Returns true if the fabrication part type exists on the fabrication service button.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationServiceButton.GetConditionName(System.Int32)
Gets the name of the specified condition on the fabrication service button.
condition:
The condition index.
Returns:
The name of the specified condition on the fabrication service button.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index condition is not larger or equal to 0 and less than ConditionCount.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.IsExcluded
Gets if the button's fabrication part content associated with the button is to be excluded from Route and Fill, Design to Fabrication, or Multi-Point Routing commands.
Returns:
Returns true if the button's parts are excluded.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationServiceButton.IsUnrestrictedCondition(System.Int32)
Checks if the condition is unrestricted.
condition:
The condition index.
Returns:
True if the condition is unrestricted.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index condition is not larger or equal to 0 and less than ConditionCount.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.GetConditionUpperValue(System.Int32)
Gets the condition upper value (valid if less) for a given condition index.
Remarks:
A value of -1 indicates an unrestricted value.
condition:
The condition index.
Returns:
The condition upper value.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index condition is not larger or equal to 0 and less than ConditionCount.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.GetConditionLowerValue(System.Int32)
Gets the condition lower value (valid if greater or equal) for a given condition index.
Remarks:
A value of -1 indicates an unrestricted value.
condition:
The condition index.
Returns:
The condition lower value.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index condition is not larger or equal to 0 and less than ConditionCount.
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.GetConditionDescription(System.Int32)
Gets the description for the condition size range.
condition:
The index of the condition in the service button.
Returns:
A user-defined string that describes the condition range, as defined in the fabrication configuration.
For example, this may describe the size of the range or describe the type of fitting.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The index condition is not larger or equal to 0 and less than ConditionCount.
Since:
2017

Autodesk.Revit.DB.FabricationServiceButton.IsValidConditionIndex(Autodesk.Revit.DB.FabricationServiceButton,System.Int32)
Validates if the given condition index is valid or not.
button:
The button to check.
condition:
The condition index.
Returns:
True if larger or equal to 0 and less than ConditionCount.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationServiceButton.PaletteIndex
The palette index for this button.
Since:
2022